IDEA StatiCa Open Model
PolyLine3D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a polyline in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.PolyLine3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PolyLine3D : OpenElementId
Public Class PolyLine3D
	Inherits OpenElementId
public ref class PolyLine3D : public OpenElementId
The PolyLine3D type exposes the following members.
Constructors
Name | Description
PolyLine3D
 Contructor
Top
Properties
Name | Description
Id
 Element Id
 (Inherited from OpenElementId.)
Segments
 Gets or sets list of references to Segment3D of PolyLine3D.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace